<a href="https://colab.research.google.com/github/priyanshgupta1998/DataScience_codes/blob/master/GroupBy_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
#import the pandas library
import pandas as pd

In [0]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [4]:
df = pd.DataFrame(ipl_data)
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

#split based on TEAM

In [7]:
team_g = df.groupby('Team')
team_g.groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [10]:
for team, data in team_g:
    print("Team:",team)
    print("data:",data)
    print("\n")

Team: Devils
data:    Points  Rank    Team  Year
2     863     2  Devils  2014
3     673     3  Devils  2015


Team: Kings
data:    Points  Rank   Team  Year
4     741     3  Kings  2014
6     756     1  Kings  2016
7     788     1  Kings  2017


Team: Riders
data:     Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
8      694     2  Riders  2016
11     690     2  Riders  2017


Team: Royals
data:     Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015


Team: kings
data:    Points  Rank   Team  Year
5     812     4  kings  2015

# Rank based

In [12]:
rank_g = df.groupby('Rank')
rank_g.groups

{1: Int64Index([0, 6, 7, 10], dtype='int64'),
 2: Int64Index([1, 2, 8, 11], dtype='int64'),
 3: Int64Index([3, 4], dtype='int64'),
 4: Int64Index([5, 9], dtype='int64')}

#Year based

In [13]:
year_g = df.groupby('Year')
year_g.groups

{2014: Int64Index([0, 2, 4, 9], dtype='int64'),
 2015: Int64Index([1, 3, 5, 10], dtype='int64'),
 2016: Int64Index([6, 8], dtype='int64'),
 2017: Int64Index([7, 11], dtype='int64')}

#Points based

In [17]:
points_g = df.groupby('Points')
points_g.groups

{673: Int64Index([3], dtype='int64'),
 690: Int64Index([11], dtype='int64'),
 694: Int64Index([8], dtype='int64'),
 701: Int64Index([9], dtype='int64'),
 741: Int64Index([4], dtype='int64'),
 756: Int64Index([6], dtype='int64'),
 788: Int64Index([7], dtype='int64'),
 789: Int64Index([1], dtype='int64'),
 804: Int64Index([10], dtype='int64'),
 812: Int64Index([5], dtype='int64'),
 863: Int64Index([2], dtype='int64'),
 876: Int64Index([0], dtype='int64')}

In [19]:
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [20]:
team_g.describe()

     Points                                                         Year  \
      count   mean        std    min     25%    50%     75%    max count
Rank
1       4.0  806.0  50.754310  756.0  780.00  796.0  822.00  876.0   4.0
2       4.0  759.0  83.070251  690.0  693.00  741.5  807.50  863.0   4.0
3       2.0  707.0  48.083261  673.0  690.00  707.0  724.00  741.0   2.0
4       2.0  756.5  78.488853  701.0  728.75  756.5  784.25  812.0   2.0


        mean       std     min      25%     50%      75%     max
Rank
1     2015.5  1.290994  2014.0  2014.75  2015.5  2016.25  2017.0
2     2015.5  1.290994  2014.0  2014.75  2015.5  2016.25  2017.0
3     2014.5  0.707107  2014.0  2014.25  2014.5  2014.75  2015.0
4     2014.5  0.707107  2014.0  2014.25  2014.5  2014.75  2015.0

In [21]:
points_g.describe()

        Rank                                    Year                      \
       count mean std  min  25%  50%  75%  max count    mean std     min
Points
673      1.0  3.0 NaN  3.0  3.0  3.0  3.0  3.0   1.0  2015.0 NaN  2015.0
690      1.0  2.0 NaN  2.0  2.0  2.0  2.0  2.0   1.0  2017.0 NaN  2017.0
694      1.0  2.0 NaN  2.0  2.0  2.0  2.0  2.0   1.0  2016.0 NaN  2016.0
701      1.0  4.0 NaN  4.0  4.0  4.0  4.0  4.0   1.0  2014.0 NaN  2014.0
741      1.0  3.0 NaN  3.0  3.0  3.0  3.0  3.0   1.0  2014.0 NaN  2014.0
756      1.0  1.0 NaN  1.0  1.0  1.0  1.0  1.0   1.0  2016.0 NaN  2016.0
788      1.0  1.0 NaN  1.0  1.0  1.0  1.0  1.0   1.0  2017.0 NaN  2017.0
789      1.0  2.0 NaN  2.0  2.0  2.0  2.0  2.0   1.0  2015.0 NaN  2015.0
804      1.0  1.0 NaN  1.0  1.0  1.0  1.0  1.0   1.0  2015.0 NaN  2015.0
812      1.0  4.0 NaN  4.0  4.0  4.0  4.0  4.0   1.0  2015.0 NaN  2015.0
863      1.0  2.0 NaN  2.0  2.0  2.0  2.0  2.0   1.0  2014.0 NaN  2014.0
876      1.0  1.0 NaN  1.0  1.0  1.0  1.0  1.0   1.0  2014.0 NaN  2014.0


           25%     50%     75%     max
Points
673     2015.0  2015.0  2015.0  2015.0
690     2017.0  2017.0  2017.0  2017.0
694     2016.0  2016.0  2016.0  2016.0
701     2014.0  2014.0  2014.0  2014.0
741     2014.0  2014.0  2014.0  2014.0
756     2016.0  2016.0  2016.0  2016.0
788     2017.0  2017.0  2017.0  2017.0
789     2015.0  2015.0  2015.0  2015.0
804     2015.0  2015.0  2015.0  2015.0
812     2015.0  2015.0  2015.0  2015.0
863     2014.0  2014.0  2014.0  2014.0
876     2014.0  2014.0  2014.0  2014.0

In [22]:
year_g.describe()

     Points                                                         Rank       \
      count    mean        std    min    25%    50%     75%    max count mean
Year
2014    4.0  795.25  87.439026  701.0  731.0  802.0  866.25  876.0   4.0  2.5
2015    4.0  769.50  65.035888  673.0  760.0  796.5  806.00  812.0   4.0  2.5
2016    2.0  725.00  43.840620  694.0  709.5  725.0  740.50  756.0   2.0  1.5
2017    2.0  739.00  69.296465  690.0  714.5  739.0  763.50  788.0   2.0  1.5


           std  min   25%  50%   75%  max
Year
2014  1.290994  1.0  1.75  2.5  3.25  4.0
2015  1.290994  1.0  1.75  2.5  3.25  4.0
2016  0.707107  1.0  1.25  1.5  1.75  2.0
2017  0.707107  1.0  1.25  1.5  1.75  2.0

In [23]:
rank_g.describe()

     Points                                                         Year  \
      count   mean        std    min     25%    50%     75%    max count
Rank
1       4.0  806.0  50.754310  756.0  780.00  796.0  822.00  876.0   4.0
2       4.0  759.0  83.070251  690.0  693.00  741.5  807.50  863.0   4.0
3       2.0  707.0  48.083261  673.0  690.00  707.0  724.00  741.0   2.0
4       2.0  756.5  78.488853  701.0  728.75  756.5  784.25  812.0   2.0


        mean       std     min      25%     50%      75%     max
Rank
1     2015.5  1.290994  2014.0  2014.75  2015.5  2016.25  2017.0
2     2015.5  1.290994  2014.0  2014.75  2015.5  2016.25  2017.0
3     2014.5  0.707107  2014.0  2014.25  2014.5  2014.75  2015.0
4     2014.5  0.707107  2014.0  2014.25  2014.5  2014.75  2015.0

# based on both 'team' & 'year'

In [18]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): Int64Index([2], dtype='int64'),
 ('Devils', 2015): Int64Index([3], dtype='int64'),
 ('Kings', 2014): Int64Index([4], dtype='int64'),
 ('Kings', 2016): Int64Index([6], dtype='int64'),
 ('Kings', 2017): Int64Index([7], dtype='int64'),
 ('Riders', 2014): Int64Index([0], dtype='int64'),
 ('Riders', 2015): Int64Index([1], dtype='int64'),
 ('Riders', 2016): Int64Index([8], dtype='int64'),
 ('Riders', 2017): Int64Index([11], dtype='int64'),
 ('Royals', 2014): Int64Index([9], dtype='int64'),
 ('Royals', 2015): Int64Index([10], dtype='int64'),
 ('kings', 2015): Int64Index([5], dtype='int64')}

# Extract Value

In [24]:
grouped = df.groupby('Year')  # split the dataset based on year and make various unique groups
print (grouped.get_group(2014))   # pick a group manually

   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014

#Once the group by object is created, several aggregation operations can be performed on the grouped data.

In [0]:
import numpy as np

In [27]:
grouped = df.groupby('Year')
print(grouped['Points'].agg(np.mean))  # calculate the meadian of all the points from each group of years.

Year
2014    795.25
2015    769.50
2016    725.00
2017    739.00
Name: Points, dtype: float64

In [29]:
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [31]:
grouped = df.groupby('Team')
grouped.groups

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [28]:
grouped = df.groupby('Team')
print(grouped.agg(np.size))

        Points  Rank  Year
Team
Devils       2     2     2
Kings        3     3     3
Riders       4     4     4
Royals       2     2     2
kings        1     1     1

In [32]:
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN